<template>
    <div>
            <div class="navbar">
      <div class="back">
        <span class="iconfont" @click="goBack">&#xe617;</span>
      </div>
      <div class="title">火车票预定协议</div>
        <!-- <div class="order" @click="myorder">我的订单</div> -->
    </div>
    <div  class='content'>
        <p>
           【审慎阅读】您在点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款及重点条款将以下划线标识，您应重点阅读。如您对协议有任何疑问，可向秘客平台客服咨询。<br><br>
火车票代订协议 <br><br>
 
第一条 协议订立<br>
1.1本协议的缔约方为在秘客火车票平台（以下简称“平台”）为用户提供火车票代订服务的服务商（“服务商”）和用户（或“您”）。<br>
1.2用户在线确认本协议后，方可使用平台服务商提供的火车票代订服务（以下简称“服务”）。<br>
1.3本协议在用户使用平台服务商提供的火车票代订服务期间一直有效。本协议生效期间，若有调整的，将会提前7天采取合理途径通知用户，若用户在协议调整后继续使用服务商提供的火车票代订服务的，视为用户同意变更后的内容；若用户不同意变更后的内容，应在变更生效前停止使用该服务。<br><br>
第二条 服务说明<br>
2.1用户委托服务商代为预订火车票，授权服务商获取用户在下单页面中提交的乘车人信息等内容。<br>
2.2服务商获得用户委托后为用户代理购买火车票。<br>
2.3由于铁路管理机构（包括国家铁路局及各级铁路监管局、中国铁路总公司及其分子公司，下同）对火车票售票的规定与要求，服务商无法承诺用户在支付后可实现百分之百出票。<br>
2.4服务内容以订单内容、本协议、秘客相关规则，及服务商在平台服务产品预订页面中公示的内容（以下简称“服务商约定”）为准。但服务商自行公示内容需符合国家相关法律法规规定，且符合本协议及平台火车票订购相关规则约定，否则无效。<br><br>
 
第三条 用户的权利和义务<br>
3.1用户在委托服务商提供相关产品服务前,应仔细阅读本协议、秘客规则及服务商所公示的流程、售后服务等服务商约定。<br>
3.2用户提交订单时，应当准确填写乘车人的姓名、身份证号、手机联系方式、日期、出发到达车站、车次、座位类型等信息内容，以确保乘车人可取票，订单一经提交无法更改填写信息。<br>
3.3用户应在提交订单后30分钟内完成付款，收到出票成功确认短信信息后出票成功。用户应按照与服务商约定自行去火车站或售票点取票并享有其他产品（如有）对应的服务。如用户未按时完成付款，则该订单将会被系统自动取消；用户付款完成后，如服务商未能购得票，则应退还用户已支付的款项。<br>
3.4用户支付成功后，如需取消订单或办理退票手续的，依据本协议约定、秘客相关规则进行。<br>
3.5用户在代订票过程中如有疑问，可向服务商咨询。如因此产生争议由用户与服务商协商解决。<br>
3.6用户授权服务商可为完成用户委托的代订火车票服务目的向铁路管理机构提交用户订单中所提交的乘车人个人信息。<br><br>
 
第四条　服务商权利义务<br>
4.1服务商承诺其为用户提供的代订票行为符合相关法律法规及秘客相关规则规定。<br>
4.2若用户申请退票的，退票手续费以铁路管理机构对外公示为准执行，服务商不得额外增加费用。服务商承诺就铁路管理机构已公示的退票相关信息，包括但不限于退票时间、退票手续费等在申请退票页面及订单页面同步更新、公示。退款一律按用户订单支付时的原支付方式退回。<br>
4.3服务商承诺对用户提交的订单信息内容保密，除为用户代订火车票外不得使用前述信息，亦不得向任何第三方泄露。<br>
4.4如服务商在为用户提供代订服务过程中存在违法违规行为，服务商应自行向用户承担相应责任，并承担因此导致的秘客平台损失。<br><br>
 
第五条　免责说明<br>
5.1因铁路管理机构随时会调整车次、票价、坐席等信息，因此，用户订购之火车票的车次、票价、坐席等信息最终以实际购买票面为准。<br>
5.2因用户提供错误订单信息所导致的损失，用户需自行承担，秘客平台及服务商不承担任何除法律有明确规定外的责任。<br>
5.3因不可抗力或铁路管理机构的原因导致用户未能如订单内容接受服务，包括但不限于铁路管理机构调整车次、因自然灾害等不可抗力因素导致的火车停运等问题，秘客平台及服务商不承担责任。<br>
5.4因不可抗力，包括但不限于黑客入侵、计算机病毒等原因造成用户资料泄露、丢失、被盗用、被篡改的，秘客平台不承担任何除法律有明确规定外的责任。<br><br>
 
第六条 争议解决及法律适用<br>
服务商为用户提供代订服务的过程中如发生争议，双方同意友好协商解决，协商不成，则任一方均有权向秘客平台所在地法院提起诉讼。<br>

        </p>
    </div>
    </div>
</template>

<script>
export default {
data () {
    return {
      
    }

},
methods: {
     goBack(){
           this.$router.go(-1)
       }
}
}
</script>

<style scoped>
.navbar {
  position: relative;
  line-height: 0.92rem;
  background-color: white;
}
.navbar .back {
  position: absolute;
  left: 0;
  top: 0;
  width: 0.92rem;
  text-align: center;
}
.navbar .back .iconfont {
  font-size: 0.42rem;
}
.navbar .order {
  position: absolute;
  right: 0.3rem;
  top: 0;
}
.navbar .title {
  text-align: center;
  font-size: 0.4rem;
  font-weight: bold;
  color: blueviolet;
}
.content{
    padding: 0.4rem;
    line-height: 0.6rem;
}

</style>
